{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "EasyBatchRenamer Plugin"
					},
					"Translation":
					{
						"Text": "简易批量重命名插件"
					},
					"Key": "EasyBatchRenamer"
				}
			]
		},
		{
			"Namespace": "FEasyBatchRenamerModule",
			"Children": [
				{
					"Source":
					{
						"Text": "EasyBatchRenamer"
					},
					"Translation":
					{
						"Text": "简易批量重命名工具"
					},
					"Key": "FEasyBatchRenamerTabTitle"
				}
			]
		},
		{
			"Namespace": "SRenamerWidget",
			"Children": [
				{
					"Source":
					{
						"Text": "Actor"
					},
					"Translation":
					{
						"Text": "Actor"
					},
					"Key": "ItemType_Actor"
				},
				{
					"Source":
					{
						"Text": "Add prefix..."
					},
					"Translation":
					{
						"Text": "添加前缀..."
					},
					"Key": "PrefixTextHint"
				},
				{
					"Source":
					{
						"Text": "Add suffix..."
					},
					"Translation":
					{
						"Text": "添加后缀..."
					},
					"Key": "SuffixTextHint"
				},
				{
					"Source":
					{
						"Text": "Apply Rename"
					},
					"Translation":
					{
						"Text": "应用重命名"
					},
					"Key": "ApplyRenameButton"
				},
				{
					"Source":
					{
						"Text": "Apply Rename"
					},
					"Translation":
					{
						"Text": "应用重命名"
					},
					"Key": "ApplyRenameTransaction"
				},
				{
					"Source":
					{
						"Text": "Asset"
					},
					"Translation":
					{
						"Text": "Asset"
					},
					"Key": "ItemType_Asset"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Failed"
					},
					"Translation":
					{
						"Text": "批量重命名失败"
					},
					"Key": "RenameFailed"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Info"
					},
					"Translation":
					{
						"Text": "批量重命名信息"
					},
					"Key": "RenameNoChange"
				},
				{
					"Source":
					{
						"Text": "Batch Rename Partial Success"
					},
					"Translation":
					{
						"Text": "批量重命名部分成功"
					},
					"Key": "RenamePartialSuccess"
				},
				{
					"Source":
					{
						"Text": "Batch rename operation was canceled. Some items might not have been renamed."
					},
					"Translation":
					{
						"Text": "批量重命名操作被取消，可能还有部分未进行重命名"
					},
					"Key": "RenameCanceled"
				},
				{
					"Source":
					{
						"Text": "Case Change:"
					},
					"Translation":
					{
						"Text": "改变大小写（只支持英文字母）："
					},
					"Key": "CaseChangeLabel"
				},
				{
					"Source":
					{
						"Text": "Enable Regex:"
					},
					"Translation":
					{
						"Text": "启用正则表达式："
					},
					"Key": "EnableRegexLabel"
				},
				{
					"Source":
					{
						"Text": "Failed to rename {0} items. See log for details."
					},
					"Translation":
					{
						"Text": "重命名失败项数量 {0}. 更多细节请查看输出日志，确保命名符合规范"
					},
					"Key": "RenameFailedFormat"
				},
				{
					"Source":
					{
						"Text": "Find Text:"
					},
					"Translation":
					{
						"Text": "查找文本："
					},
					"Key": "FindTextLabel"
				},
				{
					"Source":
					{
						"Text": "Hint: English names are recommended."
					},
					"Translation":
					{
						"Text": "温馨提示：推荐使用英文字母命名，以防使用中文出现意想不到的问题"
					},
					"Key": "RenameHint"
				},
				{
					"Source":
					{
						"Text": "Manual Name"
					},
					"Translation":
					{
						"Text": "手动命名"
					},
					"Key": "ManualNameColumn"
				},
				{
					"Source":
					{
						"Text": "No Change"
					},
					"Translation":
					{
						"Text": "不做改变"
					},
					"Key": "CaseChange_NoChange"
				},
				{
					"Source":
					{
						"Text": "No Change"
					},
					"Translation":
					{
						"Text": "不做改变"
					},
					"Key": "CaseChange_NoChange_Current"
				},
				{
					"Source":
					{
						"Text": "No items needed renaming (names might be unchanged or no items selected)."
					},
					"Translation":
					{
						"Text": "没有任何选中项需要重命名（名称或许未改变；没有项目被选中）"
					},
					"Key": "NoRenameNeeded"
				},
				{
					"Source":
					{
						"Text": "No items were renamed (names might be unchanged or no items selected)."
					},
					"Translation":
					{
						"Text": "没有任何项目执行重命名（名称也许未改变或者没有选中目标项）"
					},
					"Key": "RenameNoChangeMessage"
				},
				{
					"Source":
					{
						"Text": "Original Name"
					},
					"Translation":
					{
						"Text": "原始名称"
					},
					"Key": "OriginalNameColumn"
				},
				{
					"Source":
					{
						"Text": "Padding Digits:"
					},
					"Translation":
					{
						"Text": "编号间距："
					},
					"Key": "PaddingDigitsLabel"
				},
				{
					"Source":
					{
						"Text": "Please select assets in the Content Browser or actors in the Outliner to begin batch renaming."
					},
					"Translation":
					{
						"Text": "在开始批量重命名之前请选中内容浏览器中的 Asset 或大纲视图中的 Actor"
					},
					"Key": "NoSelectionMessage"
				},
				{
					"Source":
					{
						"Text": "Prefix:"
					},
					"Translation":
					{
						"Text": "前缀："
					},
					"Key": "PrefixTextLabel"
				},
				{
					"Source":
					{
						"Text": "Preview Name"
					},
					"Translation":
					{
						"Text": "预览名称"
					},
					"Key": "PreviewNameColumn"
				},
				{
					"Source":
					{
						"Text": "Processing Actors..."
					},
					"Translation":
					{
						"Text": "正在处理多个 Actor..."
					},
					"Key": "ProcessingActors"
				},
				{
					"Source":
					{
						"Text": "Processing Assets..."
					},
					"Translation":
					{
						"Text": "正在处理多个 Asset..."
					},
					"Key": "ProcessingAssets"
				},
				{
					"Source":
					{
						"Text": "Regex pattern to find (e.g., '^(BP_)')"
					},
					"Translation":
					{
						"Text": "使用正则表达式模式查找（例如 ^(BP_)）"
					},
					"Key": "RegexFindTextHint"
				},
				{
					"Source":
					{
						"Text": "Renamed {0} items. Failed to rename {1} items."
					},
					"Translation":
					{
						"Text": "已重命名数量 {0}. 重命名失败数量 {1}"
					},
					"Key": "RenamePartialSuccessFormat"
				},
				{
					"Source":
					{
						"Text": "Renaming Assets and Actors..."
					},
					"Translation":
					{
						"Text": "正在重命名多个 Asset 和 Actor"
					},
					"Key": "RenamingAssetsAndActors"
				},
				{
					"Source":
					{
						"Text": "Replace With:"
					},
					"Translation":
					{
						"Text": "替换为："
					},
					"Key": "ReplaceTextLabel"
				},
				{
					"Source":
					{
						"Text": "Replaced Part To Lower"
					},
					"Translation":
					{
						"Text": "替换的字母转为小写"
					},
					"Key": "CaseChange_ReplacedToLower"
				},
				{
					"Source":
					{
						"Text": "Replaced Part To Upper"
					},
					"Translation":
					{
						"Text": "替换的字母转为大写"
					},
					"Key": "CaseChange_ReplacedToUpper"
				},
				{
					"Source":
					{
						"Text": "Reset Rules"
					},
					"Translation":
					{
						"Text": "重置规则"
					},
					"Key": "ResetRulesButton"
				},
				{
					"Source":
					{
						"Text": "Start Number:"
					},
					"Translation":
					{
						"Text": "起始编号："
					},
					"Key": "StartNumberLabel"
				},
				{
					"Source":
					{
						"Text": "Successfully renamed {0} items."
					},
					"Translation":
					{
						"Text": "成功重命名项目数量 {0}"
					},
					"Key": "RenameSuccessFormat"
				},
				{
					"Source":
					{
						"Text": "Suffix:"
					},
					"Translation":
					{
						"Text": "后缀："
					},
					"Key": "SuffixTextLabel"
				},
				{
					"Source":
					{
						"Text": "Text to find..."
					},
					"Translation":
					{
						"Text": "需要查找的文本..."
					},
					"Key": "FindTextHint"
				},
				{
					"Source":
					{
						"Text": "Text to replace with..."
					},
					"Translation":
					{
						"Text": "进行替换的文本..."
					},
					"Key": "ReplaceTextHint"
				},
				{
					"Source":
					{
						"Text": "Type"
					},
					"Translation":
					{
						"Text": "类型"
					},
					"Key": "TypeColumn"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "未知"
					},
					"Key": "CaseChange_Unknown"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "未知"
					},
					"Key": "CaseChange_Unknown_Current"
				},
				{
					"Source":
					{
						"Text": "Unknown"
					},
					"Translation":
					{
						"Text": "未知"
					},
					"Key": "ItemType_Unknown"
				},
				{
					"Source":
					{
						"Text": "Use Numbering:"
					},
					"Translation":
					{
						"Text": "使用编号："
					},
					"Key": "NumberingLabel"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Lower"
					},
					"Translation":
					{
						"Text": "全部字母转为小写"
					},
					"Key": "CaseChange_ToLower_Current"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Lower"
					},
					"Translation":
					{
						"Text": "全部字母转为小写"
					},
					"Key": "CaseChange_ToLower"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Upper"
					},
					"Translation":
					{
						"Text": "全部字母转为大写"
					},
					"Key": "CaseChange_ToUpper"
				},
				{
					"Source":
					{
						"Text": "Whole Name To Upper"
					},
					"Translation":
					{
						"Text": "全部字母转为大写"
					},
					"Key": "CaseChange_ToUpper_Current"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FEasyBatchRenamerModule",
					"Children": [
						{
							"Source":
							{
								"Text": "Bring up EasyBatchRenamer window"
							},
							"Translation":
							{
								"Text": "打开简易批量重命名工具窗口"
							},
							"Key": "OpenPluginWindow_ToolTip"
						},
						{
							"Source":
							{
								"Text": "EasyBatchRenamer"
							},
							"Translation":
							{
								"Text": "简易批量重命名"
							},
							"Key": "OpenPluginWindow"
						}
					]
				}
			]
		}
	]
}